
//
//  UserNoteViewController.m
//  LiveRecorder
//
//  Created by 匹诺曹 on 17/5/26.
//  Copyright © 2017年 匹诺曹. All rights reserved.
//

#import "UserNoteViewController.h"

@interface UserNoteViewController ()

@property (nonatomic,strong) UILabel *titleLabel;
@property (nonatomic,strong) UITextView *recordTextView;
@end

@implementation UserNoteViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    
    self.title = @"用户协议";
    
    self.titleLabel = [[UILabel alloc] initWithFrame:CGRectMake(0, 64, self.view.frame.size.width, 40)];
    self.titleLabel.text = @"匹诺曹通话录音软件服务协议";
    self.titleLabel.textAlignment = NSTextAlignmentCenter;
    self.titleLabel.font = [UIFont boldSystemFontOfSize:18];
    [self.view addSubview:self.titleLabel];
    
    self.recordTextView = [[UITextView alloc] initWithFrame:CGRectMake(0, 64 + 40, self.view.frame.size.width, self.view.frame.size.height - 40 - 64 - 44)];
    [self.view addSubview:self.recordTextView];
    [self setLabelText];
}


- (void)setLabelText {
    NSString *str =@"本协议是用户（包括自然人、法人或其他组织）与杭州匹诺曹科技有限公司（以下简称""匹诺曹科技""）之间关于匹诺曹通话录音软件提供各项服务的协议。本协议内容包括协议正文以及今后随时发布的关于匹诺曹通话录音软件服务的各种规范、规则等。本协议中的匹诺曹是指由匹诺曹科技推出的iOS系统通话录音软件及其提供的现场录音、录音转文字服务等。\n我们在此特别提醒，在使用匹诺曹通话录音软件及其提供的各项服务前，请用户务必事先认真阅读本协议所有内容，并表示是否接受所有服务条款，若用户承诺接受则须遵守本协议约定；若不接受则应立即停止注册程序或停止使用匹诺曹提供的服务。用户如有不明白或不理解之处，可以向匹诺曹客服咨询。\n匹诺曹科技有权根据需要不时地制订、修改本协议及各种规范、规则等，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。如果用户不同意相关变更，应当立即停止使用匹诺曹相关服务。如用户继续使用匹诺曹服务的，即视为用户接受经修订的协议和规范、规则。\n1、服务条款的确认匹诺曹通话录音软件的所有权和运作权归匹诺曹科技所有。匹诺曹所提供的服务将按照有关法律、法规、规章、服务条款、操作规则严格执行。用户使用匹诺曹通话录音软件应详细阅读软件的用户协议及责任声明，所有使用该软件的用户即表示其与匹诺曹科技达成协议并接受所有服务条款。\n2、用户责任用户使用匹诺曹通话录音软件必须遵守国家的相关法律法规，如民法、刑法、侵权责任法、国家安全法、保密法、计算机信息系统安全保护条例、计算机软件保护条例等相关法律法规，不得损害国家以及他人的合法权益。任何情况下，匹诺曹科技有理由认为用户的行为可能违反法律、法规或可能侵害他人合法权益，就可以不经事先通知终止向该用户提供服务。用户应了解国际互联网的无国界性，应自觉注意遵守用户所在地有关法律法规。用户在使用匹诺曹通话录音软件的服务过程中，不得从事任何影响网络正常运作的行为，包括借助装置、软件或例行程序进行干预等。匹诺曹科技在任何情况下不对因服务使用人不正当使用、有意或恶意利用服务的缺陷或其他特殊的、意外的原因（或行为）造成的非直接或间接的损失承担赔偿责任。匹诺曹科技若因用户的行为（包括非法的或正常使用匹诺曹服务的行为）遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，用户应当赔偿因此造成的一切损失及费用。匹诺曹科技保留一切追偿的合法权利。\n3、服务修订匹诺曹通话录音软件保留随时修改或中断服务的权利，行使修改或中断服务的权利不需对用户或第三人负责。\n4、用户隐私匹诺曹通话录音软件尊重用户的个人隐私，任何情况下非经法律许可或用户允诺不会获取、编辑、透露、公开用户的任何隐私内容。除非遇到以下情况：\n1）遵守相关法律法规规定，或遵照国家执法部门要求\n2）出于维护匹诺曹通话录音软件的商标所有权、知识产权需要\n3）紧急情况下出于维护用户个人安全或社会大众的安全或隐私需要\n5、产品升级有关匹诺曹通话录音软件的漏洞、错误、软件功能方面的修改和完善，将会通过软件推送信息，但不会逐个通知用户。\n6、免责条款用户明确同意匹诺曹的使用由用户个人承担风险。匹诺曹不担保产品服务一定能满足用户的要求，也无法担保服务不会受中断。由于匹诺曹的各项服务涉及到互联网服务、本地操作环境、网络各环节等因素的影响，因此服务可能因计算机病毒或黑客攻击、网络提供商提供的服务差异化或出现意外状况、用户所在位置以及其他任何技术、互联网络、通信线路等原因出现异常或其他不能满足用户要求的风险。对以上因素造成的服务缺陷，匹诺曹不承担任何责任。\n7、软件所有权匹诺曹所提供的服务涉及的文字表述及组合、图片、网页设计等，以及各软件、技术均属匹诺曹科技所有，受《中华人民共和国著作权法》等法律法规、国际著作权条约、国际版权条约和其他知识产权法及条约的保护。用户未经授权不得擅自复制、篡改、或创作与之有关的派生产品，用户若存在上述行为，匹诺曹科技保留对其要求承担责任并赔偿损失的权利。\n8、用户注册\n（1）用户在进行匹诺曹注册或实际使用匹诺曹提供的服务时，应当是具备民事权利能力和民事行为能力的自然人、法人或其他组织。若用户不具备前述主体资格，匹诺曹保留对用户的帐号采取冻结使用乃至注销用户的账户等权利。\n（2）用户必须认真阅读，在完全接受本协议的情况下，方可注册成为匹诺曹的用户。一旦注册成为我们的用户，即表示同意接受协议各项条款的约束，包括接受匹诺曹今后随时对服务条款所做的任何修改。届时用户不应以未阅读本协议或不理解本协议的内容为由，主张协议无效，或要求撤销协议。\n（3）用户在注册后，应牢记用户名及登录密码，妥善保管登录密码，采取积极的保密措施保护个人信息及资料免受窃取及删除。用户名及登录密码将作为匹诺曹确认用户身份的依据，用户应对自己的用户名和密码的安全，以及通过用户名和密码实施的行为负责。\n（4）用户不得利用匹诺曹的各项服务及产品从事非法活动，包括且不限于利用产品传播、存取非法、违反公序良俗的内容，不可采用网络、电脑技术等各种手段非法获取匹诺曹产品及其云备份文件。经发现或接到举报，或有合理理由怀疑用户的帐户存在违法情况及其他违反本协议的行为时，匹诺曹有权对该帐户采取限制措施，并限期要求用户向匹诺曹公开可疑内容，限期进行整改，直至删除资料、应公安机关、司法机关的要求公开（公示）用户信息及违法内容、注销用户帐户。匹诺曹有权对用户是否存在上述违法情况、违反本协议的行为作出认定，采取上述各项措施，无须征得用户的同意。\n（5）用户个人行为（包括非法的或正常使用匹诺曹服务的行为）对任意第三方造成损害的，均应当以其自己的名义独立承担所有的法律责任，并应确保免于对匹诺曹及匹诺曹科技带来不利后果。\n（6）用户如果发现或怀疑自己的帐户被盗用，或存在其他安全问题时，应当立即以有效方式通知匹诺曹科技，并可以要求采取一定的措施。用户应配合匹诺曹科技为采取措施而实施的调查、要求补证、身份核实等工作。若用户所提供的资料未能使匹诺曹科技完全确信用户是帐户注册人时，公司有权拒绝采取措施。\n（7）如若因用户填写、预留的联系方式有误，导致匹诺曹无法与用户取得联系的，因此产生的后果由用户自行负责，包括用户使用服务过程中产生任何损失或增加费用等。\n（8）为确保录音效果，请先确认手机是否能正常安装并使用匹诺曹通话录音软件\n9、用户的变更除法律规定或司法裁定且征得匹诺曹科技的同意外，匹诺曹产品的用户名和密码不得以任何方式转让、赠与或继承（与帐户相关的财产权益除外）。\n10、用户的终止与注销出现以下情况时，匹诺曹有权直接以注销用户的方式终止本协议:\n（1）用户是不具备民事权利能力和民事行为能力的自然人、法人或其他组织；\n（2）用户利用匹诺曹通话录音软件从事违法的、侵犯他人合法权益、违背社会公序良俗的行为；\n（3）本协议（含规则）变更时，用户不愿接受新的服务协议的；\n（4）其它匹诺曹认为应当终止服务的情况。\n11、用户与匹诺曹科技的相关服务协议终止后，用户在使用匹诺曹服务期间存在的违法行为或违反本协议或规则的行为，匹诺曹科技仍可依据本协议向用户要求承担相应的法律责任。\n12、本协议解释权归匹诺曹科技所有，若其中任何条款与国家有关法律法规相抵触，则以国家法律规定为准。";
    
    
    self.recordTextView.textColor = c_333333;
    NSMutableParagraphStyle *paraStyle = [[NSMutableParagraphStyle alloc] init];
    paraStyle.lineBreakMode = NSLineBreakByCharWrapping; //结尾部分以什么方式省略
    paraStyle.alignment = NSTextAlignmentLeft; //文本对齐方式
    paraStyle.lineSpacing = 5; //字体间距
    paraStyle.firstLineHeadIndent = 24.0; //首行缩进
    paraStyle.paragraphSpacingBefore = 10.0; //段首行空白空间
    paraStyle.headIndent = 0; //整体缩进(首行除外)
    paraStyle.tailIndent = 0;
    NSDictionary *dic = @{NSFontAttributeName:[UIFont systemFontOfSize:15.0],NSKernAttributeName:@1.0f, NSParagraphStyleAttributeName:paraStyle};
    NSAttributedString *attributeStr = [[NSAttributedString alloc] initWithString:str attributes:dic];
    self.recordTextView.attributedText = attributeStr;
}

- (void)didReceiveMemoryWarning {
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}


@end
